{
  "_name_or_path": "t5-base",
  "architectures": [
    "T5ForConditionalGeneration"
  ],
  "d_ff": 3072,
  "d_kv": 64,
  "d_model": 768,
  "decoder_start_token_id": 0,
  "dropout_rate": 0.1,
  "eos_token_id": 1,
  "feed_forward_proj": "relu",
  "initializer_factor": 1.0,
  "is_encoder_decoder": true,
  "layer_norm_epsilon": 1e-06,
  "model_type": "t5",
  "n_positions": 512,
  "num_decoder_layers": 12,
  "num_heads": 12,
  "num_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "relative_attention_num_buckets": 32,
  "task_specific_params": {
    "translation_amr_to_text": {
      "corpus_dir": "amrlib/data/tdata_gsii/",
      "max_in_len": 100,
      "max_out_len": 512,
      "model_name_or_path": "t5-base",
      "train_fn": "train.txt.features.nowiki",
      "valid_fn": "dev.txt.features.nowiki"
    }
  },
  "use_cache": true,
  "vocab_size": 32128
}
